# Week 1 - Day 6
# Column add & data processing

In [1]:
import pandas as pd

df = pd.read_csv("data.csv.txt")
df

      name  score
0    Alice     85
1      Bob     72
2  Charlie     90
3    David     60

In [2]:
df["result"] = df["score"] >= 70
df

      name  score  result
0    Alice     85    True
1      Bob     72    True
2  Charlie     90    True
3    David     60   False

In [3]:
df["grade"] = df["score"].apply(
    lambda x: "PASS" if x >= 70 else "FAIL"
)
df

      name  score  result grade
0    Alice     85    True  PASS
1      Bob     72    True  PASS
2  Charlie     90    True  PASS
3    David     60   False  FAIL

In [4]:
df_sorted= df.sort_values(by="score", ascending=False)
df_sorted

      name  score  result grade
2  Charlie     90    True  PASS
0    Alice     85    True  PASS
1      Bob     72    True  PASS
3    David     60   False  FAIL

In [5]:
df[["name", "grade"]]

      name grade
0    Alice  PASS
1      Bob  PASS
2  Charlie  PASS
3    David  FAIL

In [6]:
df.to_csv("result.csv.txt", index=False)